{
  "info": {
    "name": "Pratik Nichit",
    "emailId": "nichitpratik2004@gmail.com"
  },

  "social": {
    "linkedInUrl": "https://www.linkedin.com/in/pratik-nichit-a58a83206/",
    "gitHubUrl": " https://github.com/PratikNichit",
    "instagramUrl": "https://www.instagram.com/pratik_nichit14/"
  },

  "aboutMePage": {
    "para1": "I'm a Full Stack Developer mainly Fousing on building and managing Web ,Mobile and Windows Applications that leads to the success of the overall product. Check out some of my work in the Projects section.",
    "para2": "I also like sharing content related to the stuff that I have learned over the years in Software Development so it can help other people of the Dev Community. Feel free to Connect or Follow me on my Linkedin and Github where I am open to discussion and collaboration related to Software Development and Programming",
    "para3": "I'm open to Job opportunities where I can contribute, learn and grow. If you have a good opportunity that matches my skills and experience then don't hesitate to contact me.",
    "skills": [
      "HTML",
      "CSS",
      "JavaScript",
      "TypeScript",
      "React",
      "React Native",
      "Node",
      "Express.js",
      "MongoDB",
      "MySql",
      "ShellScript",
      "MicroSoft Azure",
      "next.js",
      "tailwind.css",
      "Material UI",
      "ASP .net",
      "java",
      "Git",
      "GitHub"
    ]
  },

  "ExperiencePage": {
    "jobs": [
      {
        "role": "Frontend Developer",
        "companyName": "Herbs Magic",
        "date": "May 2023 - Aug 2023",
        "discription": "Designed and developed user-friendly web interfaces leveraging Next.js and Material UI and Tailwind.css , ensuring seamless user experiences. Optimized UI performance and collaborated closely with designers to implement features efficiently, resulting in a more polished and responsive application."
      },
      {
        "role": "Java developer Intern",
        "companyName": "QuickYes InfoTech",
        "date": "Jan 2023 - Apr 2023",
        "discription": "worked on integrating MySQL with a Java-based Windows application using JDBC, ensuring efficient database connectivity. My responsibilities included designing a reliable connection mechanism and optimizing query execution for better performance, enabling seamless data interaction between the app and the database."
      }
    ]
  }
}
